tap "asmvik/formulae", "https://github.com/asmvik/homebrew-formulae.git"
tap "fortran-lang/fortran"
tap "tejas-raskar/noted.md"
tap "tsung-ju/iguanatexmac", trusted: true
tap "koekeishiya/formulae"
# Cross-platform make
brew "cmake"
# DjVu viewer
brew "djvulibre"
# Like neofetch, but much faster because written mostly in C
brew "fastfetch"
# Play, record, convert, and stream select audio and video codecs
brew "ffmpeg"
# GNU compiler collection
brew "gcc"
# Package manager and build system for Fortran
brew "fpm"
# GNU compiler collection
brew "gcc@14"
# GitHub command-line tool
brew "gh"
# Interpreter for PostScript and PDF
brew "ghostscript"
# Distributed revision control system
brew "git"
# Agent multiplexer that lives in your terminal
brew "herdr"
# Linear Algebra PACKage
brew "lapack"
# Highly capable, feature-rich programming language
brew "perl"
# Add indentation to LaTeX files
brew "latexindent"
# Clone of ls with colorful output, file type icons, and more
brew "lsd"
# Polyglot runtime manager (asdf rust clone)
brew "mise"
# Incremental parsing library
brew "tree-sitter"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Open-source, cross-platform JavaScript runtime environment
brew "node"
# Create, run, and share large language models (LLMs)
brew "ollama", restart_service: :changed
# Execute binaries from Python packages in isolated environments
brew "pipx"
# PDF rendering library (based on the xpdf-3.0 code base)
brew "poppler"
# Software environment for statistical computing
brew "r"
# Utility that provides fast incremental file transfer
brew "rsync"
# Safe, concurrent, practical language
brew "rust"
# Fast, configurable, shell plugin manager
brew "sheldon"
# Cross-shell prompt for astronauts
brew "starship"
# Manage symlink farms — used by install.sh to link dotfiles (GNU Stow)
brew "stow"
# Easiest, most secure way to use WireGuard and 2FA
brew "tailscale"
# Command-line unarchiving tools supporting multiple formats
brew "unar"
# Extremely fast Python package installer and resolver, written in Rust
brew "uv"
# Command-line interface for Vercel
brew "vercel-cli"
# Tiling window manager based on binary space partitioning
brew "koekeishiya/formulae/yabai"
# UNIX shell (command interpreter)
brew "zsh"
# Application uninstaller
cask "appcleaner"
# E-books management software
cask "calibre"
# OpenAI's coding agent that runs in your terminal
cask "codex"
# Write, edit, and chat about your code with AI
cask "cursor"
# Voice and text chat software
cask "discord"
# App to build and share containerised applications and microservices
cask "docker-desktop"
# Web browser
cask "firefox"
cask "font-dejavu-sans-mono-nerd-font"
cask "font-fira-code-nerd-font"
cask "font-hack-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "font-plemol-jp"
cask "font-plemol-jp-hs"
cask "font-plemol-jp-nf"
# Web browser
cask "google-chrome"
cask "tsung-ju/iguanatexmac/iguanatexmac"
# GPU-based terminal emulator
cask "kitty"
cask "tsung-ju/iguanatexmac/latexit-metadata"
# Control your tools with a few keystrokes
cask "raycast"
# PDF reader and note-taking application
cask "skim"
# Team communication and collaboration software
cask "slack"
# General-purpose text editor
cask "textmate"
# GPU-accelerated cross-platform terminal emulator and multiplexer
cask "wezterm"
vscode "anthropic.claude-code"
vscode "anysphere.remote-containers"
vscode "anysphere.remote-ssh"
vscode "james-yu.latex-workshop"
cargo "nitro_cli"
cargo "nitro_plugins"
cargo "tauri-cli"
cargo "tree-sitter-cli"
uv "mlx-lm"
